# ToRoom Property

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyInstance..::..ToRoom Property
FamilyInstance Class See Also
---
The "To Room" set for the door or window.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ToRoom | The "To Room" set for the door or window in the last phase of the project. |
| [ToRoom[([( Phase])]) ](94e34f74-b6d1-2e4b-df44-b93aac5543c6.md "ToRoom Property \(Phase\)") |

# See Also
FamilyInstance Class
FamilyInstance Members
Autodesk.Revit.DB Namespace